RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b390f512gl112.h
/* Bit fields for EMU BUCTRL */
#define _EMU_BUCTRL_RESETVALUE                               0x00000000UL                              /**< Default value for EMU_BUCTRL */
#define _EMU_BUCTRL_MASK                                     0x80333307UL                              /**< Mask for EMU_BUCTRL */
#define EMU_BUCTRL_EN                                        (0x1UL << 0)                              /**< Enable Backup Mode */
#define _EMU_BUCTRL_EN_SHIFT                                 0                                         /**< Shift value for EMU_EN */
#define _EMU_BUCTRL_EN_MASK                                  0x1UL                                     /**< Bit mask for EMU_EN */
#define _EMU_BUCTRL_EN_DEFAULT                               0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_EN_DEFAULT                                (_EMU_BUCTRL_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_STATEN                                    (0x1UL << 1)                              /**< Enable Backup Mode Status Export */
#define _EMU_BUCTRL_STATEN_SHIFT                             1                                         /**< Shift value for EMU_STATEN */
#define _EMU_BUCTRL_STATEN_MASK                              0x2UL                                     /**< Bit mask for EMU_STATEN */
#define _EMU_BUCTRL_STATEN_DEFAULT                           0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_STATEN_DEFAULT                            (_EMU_BUCTRL_STATEN_DEFAULT << 1)         /**< Shifted mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_BUVINPROBEEN                              (0x1UL << 2)                              /**< Enable BU_VIN Probing */
#define _EMU_BUCTRL_BUVINPROBEEN_SHIFT                       2                                         /**< Shift value for EMU_BUVINPROBEEN */
#define _EMU_BUCTRL_BUVINPROBEEN_MASK                        0x4UL                                     /**< Bit mask for EMU_BUVINPROBEEN */
#define _EMU_BUCTRL_BUVINPROBEEN_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_BUVINPROBEEN_DEFAULT                      (_EMU_BUCTRL_BUVINPROBEEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for EMU_BUCTRL */
#define _EMU_BUCTRL_VOUTRES_SHIFT                            8                                         /**< Shift value for EMU_VOUTRES */
#define _EMU_BUCTRL_VOUTRES_MASK                             0x300UL                                   /**< Bit mask for EMU_VOUTRES */
#define _EMU_BUCTRL_VOUTRES_DEFAULT                          0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define _EMU_BUCTRL_VOUTRES_DIS                              0x00000000UL                              /**< Mode DIS for EMU_BUCTRL */
#define _EMU_BUCTRL_VOUTRES_WEAK                             0x00000001UL                              /**< Mode WEAK for EMU_BUCTRL */
#define _EMU_BUCTRL_VOUTRES_MED                              0x00000002UL                              /**< Mode MED for EMU_BUCTRL */
#define _EMU_BUCTRL_VOUTRES_STRONG                           0x00000003UL                              /**< Mode STRONG for EMU_BUCTRL */
#define EMU_BUCTRL_VOUTRES_DEFAULT                           (_EMU_BUCTRL_VOUTRES_DEFAULT << 8)        /**< Shifted mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_VOUTRES_DIS                               (_EMU_BUCTRL_VOUTRES_DIS << 8)            /**< Shifted mode DIS for EMU_BUCTRL */
#define EMU_BUCTRL_VOUTRES_WEAK                              (_EMU_BUCTRL_VOUTRES_WEAK << 8)           /**< Shifted mode WEAK for EMU_BUCTRL */
#define EMU_BUCTRL_VOUTRES_MED                               (_EMU_BUCTRL_VOUTRES_MED << 8)            /**< Shifted mode MED for EMU_BUCTRL */
#define EMU_BUCTRL_VOUTRES_STRONG                            (_EMU_BUCTRL_VOUTRES_STRONG << 8)         /**< Shifted mode STRONG for EMU_BUCTRL */
#define _EMU_BUCTRL_PWRRES_SHIFT                             12                                        /**< Shift value for EMU_PWRRES */
#define _EMU_BUCTRL_PWRRES_MASK                              0x3000UL                                  /**< Bit mask for EMU_PWRRES */
#define _EMU_BUCTRL_PWRRES_DEFAULT                           0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define _EMU_BUCTRL_PWRRES_RES0                              0x00000000UL                              /**< Mode RES0 for EMU_BUCTRL */
#define _EMU_BUCTRL_PWRRES_RES1                              0x00000001UL                              /**< Mode RES1 for EMU_BUCTRL */
#define _EMU_BUCTRL_PWRRES_RES2                              0x00000002UL                              /**< Mode RES2 for EMU_BUCTRL */
#define _EMU_BUCTRL_PWRRES_RES3                              0x00000003UL                              /**< Mode RES3 for EMU_BUCTRL */
#define EMU_BUCTRL_PWRRES_DEFAULT                            (_EMU_BUCTRL_PWRRES_DEFAULT << 12)        /**< Shifted mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_PWRRES_RES0                               (_EMU_BUCTRL_PWRRES_RES0 << 12)           /**< Shifted mode RES0 for EMU_BUCTRL */
#define EMU_BUCTRL_PWRRES_RES1                               (_EMU_BUCTRL_PWRRES_RES1 << 12)           /**< Shifted mode RES1 for EMU_BUCTRL */
#define EMU_BUCTRL_PWRRES_RES2                               (_EMU_BUCTRL_PWRRES_RES2 << 12)           /**< Shifted mode RES2 for EMU_BUCTRL */
#define EMU_BUCTRL_PWRRES_RES3                               (_EMU_BUCTRL_PWRRES_RES3 << 12)           /**< Shifted mode RES3 for EMU_BUCTRL */
#define _EMU_BUCTRL_BUACTPWRCON_SHIFT                        16                                        /**< Shift value for EMU_BUACTPWRCON */
#define _EMU_BUCTRL_BUACTPWRCON_MASK                         0x30000UL                                 /**< Bit mask for EMU_BUACTPWRCON */
#define _EMU_BUCTRL_BUACTPWRCON_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define _EMU_BUCTRL_BUACTPWRCON_NONE                         0x00000000UL                              /**< Mode NONE for EMU_BUCTRL */
#define _EMU_BUCTRL_BUACTPWRCON_MAINBU                       0x00000001UL                              /**< Mode MAINBU for EMU_BUCTRL */
#define _EMU_BUCTRL_BUACTPWRCON_BUMAIN                       0x00000002UL                              /**< Mode BUMAIN for EMU_BUCTRL */
#define _EMU_BUCTRL_BUACTPWRCON_NODIODE                      0x00000003UL                              /**< Mode NODIODE for EMU_BUCTRL */
#define EMU_BUCTRL_BUACTPWRCON_DEFAULT                       (_EMU_BUCTRL_BUACTPWRCON_DEFAULT << 16)   /**< Shifted mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_BUACTPWRCON_NONE                          (_EMU_BUCTRL_BUACTPWRCON_NONE << 16)      /**< Shifted mode NONE for EMU_BUCTRL */
#define EMU_BUCTRL_BUACTPWRCON_MAINBU                        (_EMU_BUCTRL_BUACTPWRCON_MAINBU << 16)    /**< Shifted mode MAINBU for EMU_BUCTRL */
#define EMU_BUCTRL_BUACTPWRCON_BUMAIN                        (_EMU_BUCTRL_BUACTPWRCON_BUMAIN << 16)    /**< Shifted mode BUMAIN for EMU_BUCTRL */
#define EMU_BUCTRL_BUACTPWRCON_NODIODE                       (_EMU_BUCTRL_BUACTPWRCON_NODIODE << 16)   /**< Shifted mode NODIODE for EMU_BUCTRL */
#define _EMU_BUCTRL_BUINACTPWRCON_SHIFT                      20                                        /**< Shift value for EMU_BUINACTPWRCON */
#define _EMU_BUCTRL_BUINACTPWRCON_MASK                       0x300000UL                                /**< Bit mask for EMU_BUINACTPWRCON */
#define _EMU_BUCTRL_BUINACTPWRCON_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define _EMU_BUCTRL_BUINACTPWRCON_NONE                       0x00000000UL                              /**< Mode NONE for EMU_BUCTRL */
#define _EMU_BUCTRL_BUINACTPWRCON_MAINBU                     0x00000001UL                              /**< Mode MAINBU for EMU_BUCTRL */
#define _EMU_BUCTRL_BUINACTPWRCON_BUMAIN                     0x00000002UL                              /**< Mode BUMAIN for EMU_BUCTRL */
#define _EMU_BUCTRL_BUINACTPWRCON_NODIODE                    0x00000003UL                              /**< Mode NODIODE for EMU_BUCTRL */
#define EMU_BUCTRL_BUINACTPWRCON_DEFAULT                     (_EMU_BUCTRL_BUINACTPWRCON_DEFAULT << 20) /**< Shifted mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_BUINACTPWRCON_NONE                        (_EMU_BUCTRL_BUINACTPWRCON_NONE << 20)    /**< Shifted mode NONE for EMU_BUCTRL */
#define EMU_BUCTRL_BUINACTPWRCON_MAINBU                      (_EMU_BUCTRL_BUINACTPWRCON_MAINBU << 20)  /**< Shifted mode MAINBU for EMU_BUCTRL */
#define EMU_BUCTRL_BUINACTPWRCON_BUMAIN                      (_EMU_BUCTRL_BUINACTPWRCON_BUMAIN << 20)  /**< Shifted mode BUMAIN for EMU_BUCTRL */
#define EMU_BUCTRL_BUINACTPWRCON_NODIODE                     (_EMU_BUCTRL_BUINACTPWRCON_NODIODE << 20) /**< Shifted mode NODIODE for EMU_BUCTRL */
#define EMU_BUCTRL_DISMAXCOMP                                (0x1UL << 31)                             /**< Disable MAIN-BU Comparator */
#define _EMU_BUCTRL_DISMAXCOMP_SHIFT                         31                                        /**< Shift value for EMU_DISMAXCOMP */
#define _EMU_BUCTRL_DISMAXCOMP_MASK                          0x80000000UL                              /**< Bit mask for EMU_DISMAXCOMP */
#define _EMU_BUCTRL_DISMAXCOMP_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for EMU_BUCTRL */
#define EMU_BUCTRL_DISMAXCOMP_DEFAULT                        (_EMU_BUCTRL_DISMAXCOMP_DEFAULT << 31)    /**< Shifted mode DEFAULT for EMU_BUCTRL */

